[
  {
    "eventName": "Donor Egg Introduction",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, exploring donor egg option 🤝",
    "context": "Donor eggs may be the best path forward for you.",
    "explanation": "Donor egg = Using another woman's eggs with your partner's sperm, YOU carry pregnancy. Reasons: Poor egg quality (age/repeated failures), Low ovarian reserve, Genetic conditions, Premature menopause. Success rate: 60-70% per transfer (much higher than own eggs if you're >40!).",
    "next_steps": "Options: 1) Known donor (sister/friend - legal/counseling needed). 2) Anonymous donor (egg bank - pre-frozen eggs ready). 3) Fresh donor (recruit donor, she does stimulation, you get fresh eggs). Timeline: {{timeline}}.",
    "reassurance": "Baby will have YOUR partner's genetics + YOU carry/birth/bond - very much YOUR baby! Epigenetics shows your body influences gene expression. You're still the biological mother! 💚👶",
    "call_to_action": "Think it over. Grief over genetic loss is real - counseling available. Many patients say it's best decision they made. Questions? WhatsApp!",
    "contact_info": "Dr. {{doctor_name}} | Counselor: {{counselor_phone}}"
  },
  {
    "eventName": "Donor Egg Introduction",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hi {{patient_name}} and {{partner_name}}, thank you for coming in today.",
    "context": "[EMPATHETIC] I know we've been trying with your own eggs, and this conversation about donor eggs might feel like a defeat. I want you to know it's not.",
    "explanation": "[CLEAR] Donor eggs means using eggs from another woman - either someone you know or an anonymous donor - fertilizing them with {{partner_name}}'s sperm, and transferring the embryos to {{patient_name}}'s uterus. {{patient_name}}, YOU would carry the pregnancy, give birth, and nurse the baby. The baby would have {{partner_name}}'s genetics and the donor's genetics, but not yours genetically. [PAUSE] However, and this is important - recent research shows that even though the baby doesn't have your DNA, your body DOES influence which genes get turned on or off through something called epigenetics. You're not just an incubator - your body shapes the baby's development.",
    "next_steps": "[OPTIONS] You have three donor options: \n1) Known donor - maybe your sister or a friend. Advantage: you know medical history and can tell your child about the donor. Disadvantage: complicated legal/emotional dynamics. \n2) Anonymous donor from an egg bank - pre-frozen eggs, quick process, choose based on profile photos/info. Advantage: fast, less expensive. Disadvantage: limited egg supply per donor. \n3) Fresh donor cycle - we recruit a donor who does full IVF cycle for you. Advantage: more eggs, better quality. Disadvantage: expensive, 6-month timeline, legal contracts.",
    "reassurance": "[EMPATHY] I know this is a huge emotional shift. Many patients grieve the loss of their genetic connection to their child. That's completely normal and valid. Take time to process. Talk to a counselor. But I also want to tell you - I've had hundreds of patients use donor eggs, and NOT ONE has ever told me they regret it or love their child any less. The desire to be a mother is so much deeper than genetics. When you're sleep-deprived at 3am with a crying baby, genetics won't matter - it will just be YOUR baby.",
    "call_to_action": "Don't decide today. Take weeks or months to think about it. Read stories from donor egg parents. Talk to our counselor. When you're ready, we'll discuss next steps. There's no pressure.",
    "contact_info": "I'm here to support whatever decision you make. Call me at {{clinic_phone}} anytime."
  },
  {
    "eventName": "Donor Selection - Profile Review",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, donor profiles ready for review! 📋",
    "context": "We've matched {{donor_count}} donors to your criteria.",
    "explanation": "Criteria matched: {{criteria}} (ethnicity, height, education, blood type, etc.). Profiles include: Photos (baby/adult), Medical history (3 generations), Education, Personality traits, Previous donation success rates.",
    "next_steps": "Review profiles (sent separately). Discuss with partner. Rank top 3 choices. We'll check availability. First choice usually available within {{timeline}}.",
    "reassurance": "Finding 'the right' donor feels overwhelming - but remember, you're choosing egg genetics only. YOUR love, parenting, values will shape this child 100%! 💚",
    "call_to_action": "Take your time reviewing (days/weeks okay). Some couples choose fast, others deliberate. No rush. Questions on profiles? Call us!",
    "contact_info": "Donor Coordinator: {{coordinator_phone}} | Dr. {{doctor_name}}"
  },
  {
    "eventName": "Donor Egg - Fresh Cycle Coordination",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, donor cycle coordination update 📅",
    "context": "Your donor {{donor_id}} started stimulation!",
    "explanation": "Donor's timeline: Started injections Day 2, Currently Day {{donor_cycle_day}}, Expected retrieval Day {{retrieval_day}}. YOUR timeline: Start estrogen TODAY to sync lining prep. Your lining check on Day {{lining_day}}. Transfer {{transfer_days}} days after donor retrieval.",
    "next_steps": "You: Take {{estrogen_type}} {{estrogen_dose}} daily. Lining checks Day {{check_days}}. Donor: Monitoring every 2-3 days. We coordinate both cycles to synchronize perfectly!",
    "reassurance": "Fresh donor cycles = maximum eggs (often 15-25!), fresh embryos available. You're both in this together (even though you don't meet). Teamwork! 🤝",
    "call_to_action": "Start estrogen TODAY. Attend lining checks. Stay in touch for donor updates. Excited to see this through!",
    "contact_info": "Donor Coordinator: {{coordinator_phone}} | Dr. {{doctor_name}}"
  },
  {
    "eventName": "Donor Retrieval - Excellent Results",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}} - AMAZING donor retrieval! 🥚🎉",
    "context": "Your donor's retrieval was today!",
    "explanation": "Retrieved: {{total_eggs}} eggs! Mature: {{mature_eggs}} (MII). These will be fertilized with {{partner_name}}'s sperm via ICSI. Expected {{expected_embryos}} embryos! This is EXCELLENT yield!",
    "next_steps": "Fertilization report tomorrow (Day 1). Embryo updates Day 3 & Day 5. YOUR lining check {{lining_date}} - needs to be {{target_lining}}mm+. Transfer Day {{transfer_day}} if lining perfect!",
    "reassurance": "{{mature_eggs}} donor eggs = very high success odds! Young donor eggs have {{success_rate}}% pregnancy rate per transfer. You're SO close to your baby! 🌟",
    "call_to_action": "Keep taking estrogen. Lining check coming up. Wait for fertilization report. Stay hopeful - this is happening! 💚",
    "contact_info": "Embryology | Dr. {{doctor_name}}"
  },
  {
    "eventName": "Donor Egg Fertilization - High Rate",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}} - Fertilization SUCCESS! 🧬✅",
    "context": "Donor eggs fertilized with {{partner_name}}'s sperm!",
    "explanation": "{{fertilized_count}} out of {{mature_eggs}} eggs fertilized normally (2PN) = {{fertilization_rate}}% rate! Excellent! These embryos are now growing in incubator. Day 3 update coming, Day 5 crucial for blastocyst grading.",
    "next_steps": "Embryo development tracking: Day 3 (cleavage stage), Day 5 (blastocyst formation). Best quality embryos identified. Transfer {{transfer_date}} or Freeze all for future FET.",
    "reassurance": "High fertilization rate = healthy sperm met healthy eggs! Young donor eggs fertilize better than aged eggs. Genetics working in your favor! 🧬",
    "call_to_action": "Continue estrogen for lining. Rest and stay calm. Embryo updates will come automatically. You're on track! 🎯",
    "contact_info": "Embryology | Dr. {{doctor_name}}"
  },
  {
    "eventName": "Donor Egg Day 5 - Multiple Blastocysts",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}} - INCREDIBLE blastocyst news! 🌟🎊",
    "context": "Day 5 embryo report is outstanding!",
    "explanation": "{{blastocyst_count}} blastocysts formed out of {{fertilized_count}} embryos! Grades: {{blast_grades}}. With donor eggs, blastocyst rates are typically 50-70%, and you're at {{blast_rate}}%! Quality is EXCELLENT!",
    "next_steps": "Plan: Transfer {{embryos_to_transfer}} blastocyst(s) on {{transfer_date}}. Freeze remaining {{embryos_to_freeze}} for future siblings. PGT-A testing optional (donor eggs rarely abnormal at age {{donor_age}}).",
    "reassurance": "Multiple high-quality blastocysts = multiple chances for family! Many donor egg patients have 2-3 kids from one retrieval. Your family is forming! 👶👶",
    "call_to_action": "Confirm transfer attendance {{transfer_date}} at {{transfer_time}}. Full bladder. Partner welcome. Prepare mentally - you're about to become pregnant! 🤞",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Donor Egg Transfer Success - Positive Beta",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}} - YOU'RE PREGNANT! 🎉👶💕",
    "context": "Beta hCG POSITIVE with donor egg embryo!",
    "explanation": "hCG: {{beta_value}} mIU/mL (STRONG positive!). Donor egg success rates are high, and YOU DID IT! This baby has {{partner_name}}'s genetics and YOU are the biological mother carrying it!",
    "next_steps": "Repeat beta in 48h ({{next_beta_date}}). Continue ALL meds (estrogen + progesterone - critical!). First ultrasound 6 weeks. Medication taper after 10 weeks. OB referral at 12 weeks.",
    "reassurance": "This baby is 100% YOURS - you're growing it, nourishing it, your body is creating life! Genetics fade in importance - this is YOUR CHILD! 💚👶",
    "call_to_action": "REST, hydrate, take meds religiously (don't miss doses!), report any bleeding. Celebrate carefully - early pregnancy fragile. But CELEBRATE! 🎊",
    "contact_info": "Dr. {{doctor_name}} | Emergency: {{clinic_phone}}"
  },
  {
    "eventName": "Donor Egg Pregnancy - Telling Family/Friends",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, navigating the 'disclosure' conversation 💬",
    "context": "You asked about telling people about donor eggs.",
    "explanation": "Options: 1) Full disclosure to everyone (transparent, educates others, removes secrecy). 2) Tell close family only (selective privacy). 3) Tell NO ONE except child later (personal choice, avoids judgment). 4) Tell child when age-appropriate but not extended family. There's NO right answer - it's YOUR family!",
    "next_steps": "Counselor can help navigate these conversations. Consider: What serves your CHILD best? What protects your peace? Cultural factors? Future questions from child?",
    "reassurance": "Many families keep it private, many share openly. Both are valid! Your child's well-being comes first. Most donors egg kids grow up healthy/happy regardless of disclosure timing! 💚",
    "call_to_action": "Think deeply. Discuss with partner. Talk to counselor. Decide before baby born. No judgment either way!",
    "contact_info": "Counselor: {{counselor_phone}} | Support groups available"
  },
  {
    "eventName": "Donor Egg - Frozen Egg Bank",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "{{patient_name}}, Frozen Donor Egg Bank option 🥚❄️",
    "context": "Egg bank = pre-frozen donor eggs, ready to use!",
    "explanation": "Kaise kaam karta hai: Donor pehle hi eggs donate kar chuki (stimulation + retrieval done). Eggs frozen hain database mein. Aap profile dekho, choose karo, eggs turant available (no wait!). Cost: {{cost}} for {{egg_count}} eggs (cheaper than fresh donor).",
    "next_steps": "Donor profiles available online/office. Choose donor. Purchase {{egg_count}} eggs. Thaw → Fertilize → Transfer. Total timeline: {{timeline}} (bahut fast!).",
    "reassurance": "Egg bank ka advantage: Quick (no waiting months), cheaper, success rates same as fresh! Disadvantage: Limited eggs per donor (usually 6-8 vs. fresh 15-20).",
    "call_to_action": "Review egg bank website/profiles. Decide fast or slow - no pressure. Coordinate with clinic when ready!",
    "contact_info": "Egg Bank: {{egg_bank_contact}} | Dr. {{doctor_name}}"
  },
  {
    "eventName": "Known Donor - Legal Counseling",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hi {{patient_name}}, {{donor_name}}, and {{partner_name}}. Thank you all for coming in.",
    "context": "[SERIOUS TONE] Using a known donor - especially a family member - requires careful legal and emotional planning.",
    "explanation": "[CLEAR] When {{donor_name}} donates eggs to {{patient_name}}, there are complex legal issues: Who is the legal mother? What if {{donor_name}} wants involvement in the child's life later? What if relationships sour? Can the child contact {{donor_name}} when they're 18? [PAUSE] Unlike anonymous donation, known donation creates ongoing relationships that need boundaries. I REQUIRE all parties to see a reproductive attorney AND a counselor BEFORE we proceed. This protects everyone - especially the future child.",
    "next_steps": "[REQUIREMENTS] 1) Legal contract drafted by reproductive attorney (not regular lawyer) - defines parental rights, future contact, financial agreements. 2) Psychological evaluation for {{donor_name}} - ensures she's donating freely without coercion. 3) Counseling session for all parties together - discuss future scenarios, boundaries, child disclosure. 4) Medical screening for {{donor_name}} - genetic testing, infectious disease, psych clearance. Timeline: 2-3 months for all clearances.",
    "reassurance": "[EMPATHY] I know this seems overly formal when it's family. But I've seen known donor situations go wrong when boundaries weren't clear. The legal contract protects your family relationships AND the child's best interests. It's worth the extra time and cost.",
    "call_to_action": "Here are referrals for attorney and counselor who specialize in known donor cases. Complete those steps, then we'll proceed with medical screening. No rushing - get it right.",
    "contact_info": "Attorney referral: {{attorney_name}} {{attorney_phone}} | Counselor: {{counselor_name}} {{counselor_phone}}"
  },
  {
    "eventName": "Donor Egg - Multiple Failed Transfers",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hi {{patient_name}}, it's Dr. {{doctor_name}}. I wanted to talk about the recent failed transfer.",
    "context": "[EMPATHETIC] This was your {{transfer_number}} transfer with donor eggs, and it didn't work again.",
    "explanation": "[HONEST] Donor eggs have high success rates - 60-70% per transfer for young donor eggs. After {{transfer_number}} failures, we need to investigate YOUR side - your uterus. The embryos are likely fine (young eggs, good embryos), so the issue is probably implantation. Possible causes: Uterine polyps/fibroids we missed, adenomyosis, chronic endometritis (infection), immunological issues, thin lining, or displaced implantation window (ERA test).",
    "next_steps": "[TESTING PLAN] Before using more donor embryos, I recommend: 1) Hysteroscopy - look inside uterus for polyps/scarring. 2) Endometrial biopsy - test for chronic endometritis (treatable with antibiotics). 3) ERA test - check if we're transferring at the right time (maybe need more/less progesterone). 4) Immunology panel - test for blood clotting issues, autoimmune factors. 5) Maybe mock cycle with immunology protocol (steroids, blood thinners) before next real transfer.",
    "reassurance": "[EMPATHY] I know this is devastating - you thought donor eggs would be the answer, and they haven't been yet. But please don't give up. We WILL figure out what's preventing implantation. Most of these issues are fixable. Once we identify and treat the problem, the next transfer could work.",
    "call_to_action": "Let's schedule the testing. It will take 4-6 weeks to get answers. Then we'll do a mock cycle with treatment protocol. Don't transfer another embryo until we've investigated fully - let's not waste precious embryos.",
    "contact_info": "I'm so sorry you're going through this. Let's solve it together. {{clinic_phone}}."
  },
  {
    "eventName": "Donor Egg - Single Mother by Choice",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, Single Mother by Choice journey! 💪👶",
    "context": "Using donor eggs + donor sperm to build your family solo!",
    "explanation": "Your plan: Donor eggs ({{donor_id}}) + Donor sperm ({{sperm_bank}} bank) = YOUR baby that YOU carry! Double donation is common for single women. Child will have no genetic connection to you, but YOU are the mother in every way that matters!",
    "next_steps": "Donor egg cycle coordinated. Sperm shipped from {{sperm_bank}} to clinic. Fertilization via ICSI. Transfer embryo to YOU. Legal: You're sole legal parent (no sperm donor rights).",
    "reassurance": "Single mothers by choice are AMAZING! Your child will have all the love they need from YOU. Genetics don't make a family - love does! 💚",
    "call_to_action": "Finalize sperm donor selection. Coordinate cycles. Prepare support system (friends/family). You've got this, mama! 🌟",
    "contact_info": "Dr. {{doctor_name}} | SMBC support group: {{support_contact}}"
  },
  {
    "eventName": "Donor Egg - Same-Sex Female Couple",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}} & {{partner_name}}, building your family! 🌈👶",
    "context": "Reciprocal IVF with donor egg option.",
    "explanation": "Options: 1) {{partner_name}} uses own eggs + donor sperm, {{patient_name}} carries (reciprocal IVF). 2) Use donor eggs + donor sperm, {{patient_name}} carries (if both have egg quality issues). 3) {{patient_name}} uses own eggs + donor sperm, {{partner_name}} carries. YOU decide who contributes genetics, who carries!",
    "next_steps": "Chosen plan: {{chosen_plan}}. Legal: Both moms' names on birth certificate (second-parent adoption may be needed depending on state). Sperm donor selection from {{sperm_bank}}.",
    "reassurance": "LGBTQ+ families are beautiful! Your baby will have TWO moms who wanted them SO much. Love is love! 🌈💚",
    "call_to_action": "Finalize donor selections (egg/sperm). Legal consult for parental rights. Support groups for LGBTQ+ parents available!",
    "contact_info": "Dr. {{doctor_name}} | LGBTQ+ family counselor: {{counselor_phone}}"
  },
  {
    "eventName": "Donor Egg - Cultural/Religious Concerns",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}} and {{partner_name}}, I understand you have cultural concerns about donor eggs.",
    "context": "[RESPECTFUL TONE] Many cultures and religions have specific views on third-party reproduction.",
    "explanation": "[SENSITIVE] Some religions permit egg donation, others don't. Some require anonymous donors, others prefer known. Some allow the husband's sperm but not donor eggs, or vice versa. [PAUSE] I'm not a religious authority - I can't tell you what's 'allowed' in your faith. But I can tell you that many patients from conservative backgrounds have navigated this by consulting with progressive religious scholars, seeking fatwas or rabbinic opinions, or deciding that family-building is a personal medical decision between you and God. What I can say medically: donor eggs allow YOU to carry the pregnancy, birth the baby, and raise the child - you ARE the mother in every meaningful way.",
    "next_steps": "[SUGGESTIONS] Consider: 1) Consult religious leader you trust for guidance. 2) Seek out scholars who have written about ART in your faith. 3) Join support groups for people of your background who used donor eggs - learn how they reconciled it. 4) Decide whether this is a religious issue or cultural family pressure issue - those are different. 5) Weigh the alternative - remaining childless - against using donor eggs.",
    "reassurance": "[EMPATHY] I've had patients from every religious background successfully use donor eggs and feel at peace with it spiritually. Others decided it violated their beliefs and chose adoption instead. Both are valid. This is a deeply personal decision that only you two can make.",
    "call_to_action": "Take time to explore your values, talk to religious advisors, pray/meditate on it. If you decide donor eggs are okay for you, we're here. If not, I'll support you in other paths like adoption.",
    "contact_info": "Interfaith counselor referral available if helpful: {{counselor_phone}}"
  },
  {
    "eventName": "Donor Egg - Cost Comparison",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, donor egg cost breakdown 💰",
    "context": "Financial planning for donor egg IVF.",
    "explanation": "Fresh Donor: Donor compensation {{donor_fee}}, Donor meds {{donor_meds}}, IVF cycle {{ivf_cost}}, Legal {{legal_cost}} = Total {{fresh_total}}. \nFrozen Egg Bank: Eggs {{frozen_egg_cost}}, IVF cycle {{ivf_cost}} = Total {{frozen_total}}. \nYour Own Eggs: IVF cycle {{ivf_cost}} only BUT lower success rate.",
    "next_steps": "Compare: Fresh donor = expensive but more eggs. Frozen bank = cheaper, faster, fewer eggs. Own eggs = cheapest but may fail repeatedly (cumulative cost high).",
    "reassurance": "Donor eggs seem expensive upfront but higher success = fewer cycles = maybe cheaper long-term! Calculate 'cost per baby' not 'cost per cycle'. 💡",
    "call_to_action": "Financial counseling available. Payment plans. Insurance check (some cover!). Budget, then decide.",
    "contact_info": "Finance Dept: {{finance_phone}} | Dr. {{doctor_name}}"
  }
]
