[
  {
    "eventName": "IUI Consultation - First Time",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "You're taking the first step towards starting a family 🌟",
    "explanation": "Intrauterine Insemination (IUI) is a fertility treatment where sperm is directly placed in the uterus. We'll discuss your medical history, ovarian reserve, and the best time for IUI 📆",
    "next_steps": "We'll schedule an ultrasound to monitor follicle growth and time the IUI procedure 📊",
    "reassurance": "Don't worry, we're here to support you throughout this journey 🌈",
    "call_to_action": "Please arrive 15 minutes prior to your scheduled appointment time ⏰",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Consultation - First Time",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] welcome to our clinic [EMPATHY]",
    "context": "I understand that you're considering IUI as a fertility option, [GENTLE TONE] and we're here to guide you through the process",
    "explanation": "During the IUI procedure, [PAUSE] sperm is inserted directly into the uterus, [EMPATHY] and we'll discuss the best timing based on your menstrual cycle and ovulation",
    "next_steps": "We'll schedule an ultrasound to monitor follicle growth, [GENTLE TONE] and then we'll proceed with the IUI procedure",
    "reassurance": "You're not alone in this journey, [EMPATHY] and we're committed to supporting you every step of the way",
    "call_to_action": "Please arrive 15 minutes prior to your scheduled appointment time, [GENTLE TONE] and don't hesitate to reach out if you have any questions",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Day 1 - Cycle Start",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "You're starting your IUI cycle today!",
    "explanation": "This cycle, you'll be taking {{medication}} to stimulate follicle growth. We'll monitor your progress with regular scans. Your first scan is scheduled on {{first_scan_date}}.",
    "next_steps": "Start taking {{medication}} as prescribed. Attend your scan on {{first_scan_date}}.",
    "reassurance": "You're taking the first step towards parenthood! We're here to support you throughout this journey. 😊",
    "call_to_action": "If you have any questions, feel free to WhatsApp us!",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Day 1 - Cycle Start",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hi {{patient_name}}, [PAUSE] this is [Your Name] from the clinic.",
    "context": "[EMPATHY] I know you must be feeling a bit anxious about starting your IUI cycle today. But don't worry, we're here to guide you through every step of the way.",
    "explanation": "[GENTLE TONE] You'll be taking {{medication}} to stimulate follicle growth. We'll be monitoring your progress with regular scans, and your first scan is scheduled on {{first_scan_date}}.",
    "next_steps": "Please start taking {{medication}} as prescribed, and don't forget to attend your scan on {{first_scan_date}}.",
    "reassurance": "[EMPATHY] I completely understand that this can be a stressful time, but you're taking a huge step towards becoming a parent. We're here to support you, and we're all rooting for you.",
    "call_to_action": "[GENTLE TONE] If you have any questions or concerns, please don't hesitate to reach out to us. We're just a phone call away.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Follicle Tracking Day 10",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "You're 10 days into your IUI follicle tracking journey 📊",
    "explanation": "Your follicles are growing well! You have {{follicle_count}} follicles with the lead follicle measuring {{lead_follicle_size}}mm. Your estradiol (E2) level is {{e2_level}} pg/mL, indicating a good response to medications 💊",
    "next_steps": "Continue your current medication regimen and we'll schedule your next scan for {{next_appointment}} 📅",
    "reassurance": "You're doing great! This is exactly what we want to see at Day 10 🙌",
    "call_to_action": "Keep taking your medications as prescribed and reach out if you have any questions 🤔",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Follicle Tracking Day 10",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] I hope you're doing well today [EMPATHY]",
    "context": "I'd like to discuss your IUI follicle tracking progress with you [GENTLE TONE]. You're currently 10 days into the process",
    "explanation": "Your ultrasound scan shows that you have {{follicle_count}} follicles, with the lead follicle measuring {{lead_follicle_size}}mm. Your estradiol level is {{e2_level}} pg/mL, which indicates a good response to the medications [EMPATHY]",
    "next_steps": "We recommend that you continue your current medication regimen and schedule your next scan for {{next_appointment}} [GENTLE TONE]",
    "reassurance": "Please don't worry, [PAUSE] you're doing great [EMPATHY]. This is exactly what we want to see at Day 10",
    "call_to_action": "If you have any questions or concerns, please don't hesitate to reach out to us [GENTLE TONE]",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Trigger Shot Instructions",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "You're getting close to your IUI procedure! 📆",
    "explanation": "Your trigger shot is scheduled for today. This shot will help your eggs mature and get ready for the IUI procedure. You'll receive a dose of hCG (human chorionic gonadotropin) to stimulate ovulation. 🌟",
    "next_steps": "Please come to our clinic today at the scheduled time for the trigger shot. After the shot, you'll need to wait 34-40 hours before the IUI procedure. 🕒",
    "reassurance": "Don't worry, our team is here to support you throughout this process. You're doing great, and we're excited for your IUI procedure! 🤞",
    "call_to_action": "Arrive at the clinic at least 15 minutes before your scheduled time. If you have any questions, feel free to WhatsApp us! 📲",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Trigger Shot Instructions",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] I hope you're doing well today. [EMPATHY]",
    "context": "We've scheduled your trigger shot for today, [GENTLE TONE] which is an important step before your IUI procedure.",
    "explanation": "The trigger shot, [PAUSE] also known as the hCG shot, will help your eggs mature and get ready for the procedure. You'll receive a dose of hCG to stimulate ovulation, [EMPATHY] and we'll guide you through the entire process.",
    "next_steps": "Please arrive at our clinic today at the scheduled time, [GENTLE TONE] and our team will take care of the rest. After the shot, you'll need to wait 34-40 hours before the IUI procedure, [PAUSE] so we'll schedule that accordingly.",
    "reassurance": "I know this can be a bit overwhelming, [EMPATHY] but our team is here to support you every step of the way. You're doing great, and we're excited for your IUI procedure, [GENTLE TONE] so let's take it one step at a time.",
    "call_to_action": "If you have any questions or concerns, [PAUSE] please don't hesitate to reach out to us. We're always here to help, [EMPATHY] and we want to make sure you feel comfortable and supported throughout this process.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Procedure Day Instructions",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "Your IUI procedure is scheduled for today.",
    "explanation": "Please arrive at the clinic 30 minutes prior to your scheduled time. You will need to provide a semen sample, which will be washed and prepared for the procedure. The IUI process typically takes about 15-20 minutes, and you may experience mild cramping.",
    "next_steps": "After the procedure, you will need to rest for 30 minutes before leaving the clinic. You can resume normal activities, but avoid heavy lifting or strenuous exercise for the next 24 hours.",
    "reassurance": "Don't worry, our team is here to support you throughout the process. We understand this can be a nerve-wracking time, but we're here to help you every step of the way 🌟",
    "call_to_action": "If you have any questions or concerns, please don't hesitate to reach out to us. We're just a WhatsApp away! 📲",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Procedure Day Instructions",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] this is [Your Name] from the clinic.",
    "context": "I wanted to go over the instructions for your IUI procedure scheduled for today, [EMPATHY] I know you must be feeling a bit anxious.",
    "explanation": "When you arrive at the clinic, [GENTLE TONE] please come 30 minutes prior to your scheduled time. We will need a semen sample from your partner, which will be washed and prepared for the procedure. The IUI process itself is relatively quick, about 15-20 minutes, and you may experience some mild cramping.",
    "next_steps": "After the procedure, [PAUSE] you'll need to rest for about 30 minutes before leaving the clinic. Then, you can resume your normal activities, but [EMPATHY] please do avoid any heavy lifting or strenuous exercise for the next 24 hours.",
    "reassurance": "I want to reassure you, [GENTLE TONE] our team is here to support you throughout this process. We understand it can be a stressful time, but [REASSURANCE] we're here to help you every step of the way.",
    "call_to_action": "If you have any questions or concerns, [PAUSE] please don't hesitate to reach out to us. You can call us at {{clinic_phone}} or speak with Dr. {{doctor_name}} directly.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Post-Procedure 24h Care",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "You've completed your IUI procedure yesterday 📆",
    "explanation": "It's essential to rest for 24 hours and avoid heavy lifting or strenuous activities 🛋️. You may experience some mild cramping or spotting, which is completely normal 🌟",
    "next_steps": "Take your prescribed medications as directed by Dr. {{doctor_name}} and attend your follow-up appointment scheduled on {{next_appointment}} 📅",
    "reassurance": "You're doing great! 😊 This is an exciting time, and we're all rooting for you. Remember, our team is here to support you throughout your journey 🤗",
    "call_to_action": "If you have any questions or concerns, please don't hesitate to reach out to us on {{clinic_phone}} 📞",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Post-Procedure 24h Care",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] I hope you're doing well today [EMPATHY]",
    "context": "I wanted to follow up with you after your IUI procedure yesterday [GENTLE TONE]. How are you feeling today?",
    "explanation": "It's crucial to rest for the next 24 hours and avoid any heavy lifting or strenuous activities [EMPATHY]. You may experience some mild cramping or spotting, which is completely normal [REASSURING TONE]",
    "next_steps": "Please take your prescribed medications as directed by Dr. {{doctor_name}} and attend your follow-up appointment scheduled on {{next_appointment}} [GENTLE TONE]. Do you have any questions about your medication or appointment?",
    "reassurance": "You're doing great, and we're all very optimistic about the outcome [EMPATHY]. Remember, our team is here to support you throughout your journey [REASSURING TONE]",
    "call_to_action": "If you have any questions or concerns, please don't hesitate to reach out to us on {{clinic_phone}} [GENTLE TONE]",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Two Week Wait Guidance",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "You've completed your IUI procedure and now it's time to wait 📆",
    "explanation": "Over the next two weeks, your body will be preparing for a potential pregnancy. You might experience some symptoms like mood swings, breast tenderness, or mild cramping - these are all normal 🙏",
    "next_steps": "Take a pregnancy test 14 days after IUI. If it's positive, schedule a follow-up appointment with us 📅",
    "reassurance": "Try to relax and stay positive during this time 🙏. We're here to support you, and we'll guide you through the next steps 🤗",
    "call_to_action": "Reach out to us if you have any questions or concerns 📲",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Two Week Wait Guidance",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] this is a call from the clinic. How are you doing today? [EMPATHY]",
    "context": "I wanted to follow up with you regarding your recent IUI procedure [GENTLE TONE]. You're now in the two-week waiting period",
    "explanation": "During this time, your body will be adjusting to the procedure, and you might experience some symptoms such as mood swings or breast tenderness [EMPATHY]. These are completely normal and usually subside on their own",
    "next_steps": "We recommend taking a pregnancy test 14 days after the IUI [PAUSE]. If the test is positive, please schedule a follow-up appointment with us to confirm the pregnancy and discuss next steps",
    "reassurance": "I know this can be a stressful and emotional time [EMPATHY], but please try to relax and stay positive. We're here to support you throughout this journey [GENTLE TONE]",
    "call_to_action": "If you have any questions or concerns, don't hesitate to reach out to us [PAUSE]. We're always here to help",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Beta hCG Positive Result",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 🎉",
    "context": "We have your IUI beta hCG test results.",
    "explanation": "Your hCG level is {{hcg_level}} mIU/mL, indicating a positive pregnancy test! This is a great start. You underwent IUI {{days_since_iui}} days ago.",
    "next_steps": "Schedule a follow-up appointment with Dr. {{doctor_name}} in 2 weeks for a viability scan to confirm a healthy pregnancy.",
    "reassurance": "Congratulations! This is wonderful news. We're thrilled for you 🙏",
    "call_to_action": "Book your follow-up scan by calling {{clinic_phone}} or replying to this message.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Beta hCG Positive Result",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hi {{patient_name}}, [PAUSE] this is [Your Name] from the clinic.",
    "context": "I am calling to share the results of your recent IUI beta hCG test.",
    "explanation": "[EMPATHY] I know how anxious you must be, but I'm delighted to inform you that your hCG level is {{hcg_level}} mIU/mL, which indicates a positive pregnancy test. [GENTLE TONE] This is a great start, considering you underwent IUI {{days_since_iui}} days ago.",
    "next_steps": "[GENTLE TONE] We would like to schedule a follow-up appointment with Dr. {{doctor_name}} in about two weeks for a viability scan to confirm a healthy pregnancy.",
    "reassurance": "[EMPATHY] I completely understand this is a life-changing moment for you. [PAUSE] We're all very happy for you, and we're here to support you throughout this journey.",
    "call_to_action": "[GENTLE TONE] To book your follow-up scan, please call us back at {{clinic_phone}} at your earliest convenience.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Beta hCG Negative Result",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 🤗",
    "context": "We've received your beta hCG test results.",
    "explanation": "Unfortunately, the results show that the hCG levels are not detectable, indicating that the IUI cycle was not successful this time. 🙏",
    "next_steps": "We recommend discussing next steps with Dr. {{doctor_name}} to explore further options, such as another IUI cycle or considering other fertility treatments like IVF.",
    "reassurance": "Please know that this is not uncommon, and many couples experience a negative result before achieving a successful pregnancy. You're not alone in this journey! 💕",
    "call_to_action": "Let's schedule a follow-up consultation to discuss the next steps. Reply to this message or call us at {{clinic_phone}}.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Beta hCG Negative Result",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] I'm so sorry to inform you that your beta hCG test results are in, [EMPATHY] and unfortunately, they're not what we were hoping for.",
    "context": "The test shows that the hCG levels are not detectable, [GENTLE TONE] which means that the IUI cycle was not successful this time.",
    "explanation": "I know this can be disappointing news, [EMPATHY] but please know that this is a common outcome, and many couples experience a negative result before achieving a successful pregnancy. [PAUSE] We can discuss next steps and explore further options, such as another IUI cycle or considering other fertility treatments like IVF.",
    "next_steps": "Let's schedule a follow-up consultation with Dr. {{doctor_name}} to discuss the next steps, [GENTLE TONE] and we'll work together to find the best course of action for you.",
    "reassurance": "You're not alone in this journey, [EMPATHY] and we're here to support you every step of the way. [PAUSE] Remember, this is not a reflection of your ability to become a parent, and we'll do everything we can to help you achieve your dream of having a child.",
    "call_to_action": "Shall we schedule a follow-up consultation at your earliest convenience? You can reach us at {{clinic_phone}}.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI vs IVF Decision Making",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! 👋",
    "context": "You're considering your options for fertility treatment and we're here to support you 🤝",
    "explanation": "IUI (Intrauterine Insemination) and IVF (In Vitro Fertilization) are both viable options, but they have different success rates and requirements 📊. IUI is less invasive and less expensive, but it may take several attempts to achieve pregnancy 🤞. IVF, on the other hand, has a higher success rate, but it's more invasive and expensive 📈",
    "next_steps": "We recommend discussing your options with Dr. {{doctor_name}} to determine the best course of treatment for you 📅",
    "reassurance": "We understand that this can be a difficult and emotional decision, but we're here to support you every step of the way 🌈",
    "call_to_action": "Reply to this message or call us at {{clinic_phone}} to schedule a consultation with Dr. {{doctor_name}} 📞",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI vs IVF Decision Making",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, [PAUSE] I hope you're doing well today [EMPATHY]",
    "context": "I understand that you're considering your options for fertility treatment and I'm here to support you [GENTLE TONE]",
    "explanation": "Let me explain the difference between IUI and IVF [PAUSE]. IUI, or Intrauterine Insemination, is a less invasive procedure where sperm is inserted directly into the uterus [EMPATHY]. IVF, or In Vitro Fertilization, is a more invasive procedure where the egg is fertilized outside the body and then transferred to the uterus [GENTLE TONE]",
    "next_steps": "I recommend that you discuss your options with Dr. {{doctor_name}} to determine the best course of treatment for you [PAUSE]",
    "reassurance": "I know that this can be a difficult and emotional decision, but please know that we're here to support you every step of the way [EMPATHY]",
    "call_to_action": "Can I schedule a consultation for you with Dr. {{doctor_name}} at your earliest convenience [GENTLE TONE]?",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Two Week Wait Guidance",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, TWW begins now! 🤞",
    "context": "You're in the Two Week Wait (TWW) after IUI - the waiting period before pregnancy test.",
    "explanation": "For the next 14 days, your body will decide if the sperm met egg and implanted. Beta hCG test scheduled {{beta_date}}. During TWW: Take progesterone support (if prescribed), Rest (no heavy exercise), Watch for implantation bleeding (light spotting Day 6-12 normal).",
    "next_steps": "Continue medications EXACTLY as prescribed. Avoid: Sex, hot baths, alcohol, smoking. Normal activities okay - bed rest doesn't improve success!",
    "reassurance": "TWW is hardest part - anxiety normal! Try to stay busy, avoid symptom-spotting (progesterone causes same symptoms as pregnancy). We're hopeful! 🌟",
    "call_to_action": "Beta test {{beta_date}} - DON'T take home pregnancy test before (can be false negative). Questions? WhatsApp anytime!",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI Two Week Wait Guidance",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hi {{patient_name}}, it's Nurse {{nurse_name}}. How are you feeling after the procedure?",
    "context": "[GENTLE TONE] You're now in what we call the Two Week Wait - the time between IUI and your pregnancy test.",
    "explanation": "For the next 14 days, implantation may or may not happen - it's completely out of our hands now. [PAUSE] Your beta hCG test is scheduled for {{beta_date}}. During this time, you'll continue taking progesterone if prescribed. You may notice light spotting around Day 6-12 - that can be implantation bleeding, which is actually a good sign. [EMPATHY] But it's also normal to have no symptoms.",
    "next_steps": "Keep taking all medications exactly as prescribed - don't skip doses. [CLEAR] Avoid intercourse, hot baths, alcohol, and smoking. But you can do normal daily activities - bed rest doesn't improve success rates, so don't feel you need to lie in bed for two weeks.",
    "reassurance": "[EMPATHY] I know the wait is incredibly hard. Many patients say this is the worst part - the not knowing. Try to keep yourself busy. [GENTLE TONE] Avoid Googling symptoms or taking home pregnancy tests too early - they can give false results and just increase anxiety.",
    "call_to_action": "Come in for your beta test on {{beta_date}}. That's the only way to know for sure. [PAUSE] And please, call us if you have severe pain, heavy bleeding, or fever - those need immediate attention.",
    "contact_info": "You can reach me or Dr. {{doctor_name}} anytime at {{clinic_phone}}."
  },
  {
    "eventName": "IUI Beta hCG Positive Result",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}} - CONGRATULATIONS! 🎉👶💕",
    "context": "Your beta hCG test is POSITIVE - you're pregnant!",
    "explanation": "hCG level: {{beta_value}} mIU/mL (Positive = >5, yours is GREAT for {{days_post_iui}} days post-IUI!). This confirms successful implantation! IUI success rate is 10-20% per cycle, and YOU DID IT! 🌟",
    "next_steps": "Repeat beta in 48 hours ({{next_beta_date}}) - should double. Continue ALL medications (progesterone critical!). First ultrasound at 6 weeks. NO sex, heavy lifting.",
    "reassurance": "This is REAL! Early pregnancy is fragile - some spotting normal, but report heavy bleeding. Most IUI pregnancies proceed normally to healthy baby! 💚",
    "call_to_action": "CELEBRATE but stay cautious! Keep taking meds. Come for repeat beta {{next_beta_date}}. Any bleeding/cramping? Call immediately!",
    "contact_info": "Dr. {{doctor_name}} | Emergency: {{clinic_phone}}"
  },
  {
    "eventName": "IUI Beta hCG Positive Result",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}}, it's Dr. {{doctor_name}}. [PAUSE] I have wonderful news for you.",
    "context": "[WARM TONE] Your beta hCG test came back positive - you're pregnant!",
    "explanation": "Your hCG level is {{beta_value}}, which is a really good number for {{days_post_iui}} days after the IUI procedure. [PAUSE] This means the sperm successfully fertilized the egg and it implanted in your uterus. [EMPATHY] I know you've been waiting for this moment.",
    "next_steps": "[CLEAR] Here's what happens next: You'll need to come back in 48 hours for a repeat beta test on {{next_beta_date}}. We expect the number to roughly double - that's how we confirm the pregnancy is progressing well. Keep taking ALL your medications, especially progesterone - don't stop anything yet. Your first ultrasound will be around 6 weeks to confirm the heartbeat.",
    "reassurance": "[GENTLE TONE] I'm thrilled for you, but I also want to set realistic expectations. Early pregnancy is a sensitive time. Some light spotting is normal, but if you have heavy bleeding or severe cramping, call us right away. [PAUSE] The vast majority of IUI pregnancies that start with good beta numbers like yours go on to be healthy babies.",
    "call_to_action": "For now: celebrate this milestone, but take it easy. No sex, no heavy lifting. Keep taking your medications religiously. And come see us for that repeat beta.",
    "contact_info": "[WARM] Congratulations again. Call me anytime at {{clinic_phone}} if you have any concerns."
  },
  {
    "eventName": "IUI Beta hCG Negative Result",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}}, it's Dr. {{doctor_name}}. Do you have a moment to talk?",
    "context": "[GENTLE TONE] I'm calling with your beta hCG results, and [PAUSE] I'm sorry to tell you the test was negative.",
    "explanation": "Your hCG level was {{beta_value}}, which is below the threshold for pregnancy (we need >5). [EMPATHY] This means the IUI cycle didn't result in pregnancy this time. I know this isn't the news you were hoping for, and I'm truly sorry.",
    "next_steps": "[CLEAR] You can stop taking progesterone and any other medications. Your period should start within the next week. [PAUSE] When it does, call us on Day 1 if you want to try another IUI cycle. There's no required waiting period - you can start right away if you're ready.",
    "reassurance": "[EMPATHY] I know this is devastating. [PAUSE] But please don't lose hope - the success rate for IUI is 10-20% per cycle, which means most people need 3-4 attempts. Your body responded well to the medications (good follicle count: {{follicle_count}}), so there's no reason to think it won't work next time. Some people just need multiple tries.",
    "call_to_action": "Take time to grieve this loss - it's real, even though the pregnancy never developed. [GENTLE TONE] When you're ready, we can discuss next steps: try IUI again, adjust medications, or consider moving to IVF if you've had multiple failed IUIs. No pressure - take the time you need.",
    "contact_info": "[EMPATHY] I'm here if you want to talk. Call me anytime at {{clinic_phone}}. I'm so sorry."
  },
  {
    "eventName": "IUI vs IVF Decision Making",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "{{patient_name}}, let's discuss IUI vs IVF 🤔",
    "context": "You've tried {{iui_attempts}} IUI cycle(s) without success - considering IVF?",
    "explanation": "IUI success: 10-20% per cycle. After {{iui_attempts}} failures, cumulative odds dropping. IVF success: 40-60% per cycle (much higher!). IVF better if: Age >35, Low sperm count, Blocked tubes, Endometriosis, >3-4 failed IUIs. IUI cheaper (₹15-20K) but lower success. IVF expensive (₹1.5-2L) but higher success = fewer cycles needed.",
    "next_steps": "Options: 1) Try 1-2 more IUI cycles (if young + no other issues). 2) Move to IVF now (recommended if >35 or other factors). 3) Take break, decide later. Consult with Dr. {{doctor_name}} to review case.",
    "reassurance": "Failed IUIs don't mean you can't get pregnant! IVF gives more control - we retrieve eggs, see fertilization, pick best embryos. Many IUI failures succeed with IVF! 💪",
    "call_to_action": "Schedule IVF consultation to discuss costs, timeline, success odds for YOUR case. No obligation - just information!",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "IUI vs IVF Decision Making",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}}, thank you for coming in. I wanted to have an honest conversation with you about next steps.",
    "context": "[EMPATHETIC] You've completed {{iui_attempts}} IUI cycles without success. I know that's been really hard.",
    "explanation": "[CLEAR] Let me explain the statistics. IUI has about a 10-20% success rate per cycle. After {{iui_attempts}} attempts, the cumulative odds of it working are actually declining. [PAUSE] IVF, on the other hand, has a 40-60% success rate per cycle depending on age and other factors. It's significantly higher. [HONEST] Now, IVF costs more - around ₹1.5-2 lakhs per cycle versus ₹15-20K for IUI. But if you need 6 IUI cycles to get the same chance as 2 IVF cycles, the math actually favors IVF in the long run.",
    "next_steps": "[OPTIONS] Here are your choices: First, you could try 1-2 more IUI cycles if you're under 35 and there are no other issues - some people do succeed on attempt 4 or 5. Second, you could move to IVF now, which is what I'd recommend if you're over 35, have low sperm parameters, or have tried IUI 3+ times. Third, you could take a break and decide later - there's no rush if you need time emotionally or financially.",
    "reassurance": "[EMPATHY] Failed IUIs absolutely do not mean you can't get pregnant. IVF gives us much more control - we can see the eggs, watch them fertilize, choose the best embryos, and place them directly in the uterus. Many patients who fail IUI succeed on their first or second IVF cycle. You're not a failure - sometimes the method just needs to be more aggressive.",
    "call_to_action": "I'd like to schedule an IVF consultation for you - no obligation, just to give you all the information about costs, timeline, and your specific success odds. Then you can make an informed decision. Does that sound okay?",
    "contact_info": "Think it over and call me at {{clinic_phone}} when you're ready to talk more."
  }
]