[
  {
    "eventName": "PGT-A Results - All Normal Embryos",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! Wonderful news regarding your embryos! 🌟🧬",
    "context": "We have received the PGT-A (genetic testing) report from the lab today.",
    "explanation": "Great news: Out of the {{embryo_count}} embryos sent for biopsy, ALL came back as 'Euploid' (chromosomally normal). This is the best possible outcome! These embryos have the correct number of chromosomes (46), which significantly increases implantation success rates to ~60-70% and reduces miscarriage risk.",
    "next_steps": "We can now plan for a Frozen Embryo Transfer (FET). We will wait for your period to start. Please message us on Day 1 of your next cycle.",
    "reassurance": "This validates that your egg quality is excellent. We have a very strong starting point for your pregnancy journey. 💚",
    "call_to_action": "Enjoy this victory! Please acknowledge this message so we know you've received the good news.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Results - All Abnormal Embryos",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, this is Dr. {{doctor_name}}. Is now a good time to talk privately?",
    "context": "[GENTLE TONE] I have received the PGT-A genetic report for your embryos, and I'm afraid the news is difficult today.",
    "explanation": "Unfortunately, all {{embryo_count}} embryos tested as 'Aneuploid'. [PAUSE] This means they had chromosomal abnormalities—either missing or extra chromosomes—which makes them incompatible with life. If we had transferred these, it would have resulted in a negative test or a miscarriage.",
    "next_steps": "[EMPATHY] I know this is heartbreaking. We need to pause and review the full report together. There are options—changing the stimulation protocol to improve quality, considering dual-stim, or discussing donor gametes depending on the specific genetic errors found.",
    "reassurance": "[GENTLE] Please know this is not because of anything you did wrong. This is a biological hurdle, common with age or specific genetic factors. The silver lining is that PGT-A saved you from the emotional trauma of a miscarriage or failed transfer.",
    "call_to_action": "Take some time to process this. When you are ready, let's meet in person on {{next_consult_date}} to map out a new strategy. We are not giving up on you.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Cost-Benefit Analysis",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}}, regarding your query about PGT-A testing. 🧬🤔",
    "context": "Aapne poocha tha ki genetic testing (PGT-A) karwana zaroori hai ya nahi.",
    "explanation": "Dekhiye, PGT-A extra cost add karta hai (approx ₹15-20k per embryo), but iske benefits long-term mein cost-saving ho sakte hain. Normal IVF mein hum sirf embryo ki 'shape' (morphology) dekhte hain, par PGT-A se hume 'DNA' ka pata chalta hai. Agar embryo genetically abnormal hua, toh transfer fail hoga ya miscarriage hoga.",
    "next_steps": "Agar aapki age 35+ hai ya previous miscarriages huye hain, toh Dr. {{doctor_name}} strongly recommend karte hain. Agar age kam hai, toh hum skip bhi kar sakte hain.",
    "reassurance": "Isse 'Time to Pregnancy' kam ho jata hai kyunki hum sirf best embryo transfer karte hain. Blind firing nahi hoti.",
    "call_to_action": "Please discuss with {{partner_name}} and let us know by tomorrow morning before the biopsy deadline.",
    "contact_info": "Counselor {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Severe OHSS - Hospitalization Required",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}}, this is Dr. {{doctor_name}}. I am calling about the symptoms you reported.",
    "context": "[URGENT] Based on your bloating and difficulty breathing, I suspect you have developed severe Ovarian Hyperstimulation Syndrome (OHSS).",
    "explanation": "Your ovaries have responded too strongly to the medication, causing fluid to leak into your abdomen (ascites). This is why you feel breathless and your urine output has dropped. This requires immediate medical management to balance your fluids and prevent clots.",
    "next_steps": "[DIRECTIVE] You need to be admitted to the hospital immediately for IV fluids and monitoring. Do not eat or drink anything for now. Pack a bag for 2-3 days.",
    "reassurance": "This is a known complication and is completely treatable. By admitting you, we can resolve this much faster and ensure you are safe. It does NOT affect your frozen embryos—they remain safe.",
    "call_to_action": "Please go to {{hospital_name}} Emergency Room immediately. I have already called the admission desk. They are expecting you.",
    "contact_info": "Dr. {{doctor_name}} | Emergency Line: {{clinic_phone}}"
  },
  {
    "eventName": "Total Fertilization Failure - Zero Embryos",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}}, it's Dr. {{doctor_name}}. I need to discuss the lab results from yesterday's retrieval.",
    "context": "[GENTLE/SERIOUS] I have some unexpected and difficult news regarding the fertilization of your eggs.",
    "explanation": "Despite retrieving {{total_eggs}} eggs and performing ICSI (injecting sperm directly), none of the eggs have fertilized normally to form embryos. This is called 'Total Fertilization Failure'. It is a rare occurrence (1-3% of cycles) usually caused by an activation issue within the egg or sperm that we couldn't see beforehand.",
    "next_steps": "This cycle will not result in a transfer. We need to investigate if 'Oocyte Activation' (calcium ionophore) can help in a future cycle, or analyze the sperm DNA fragmentation more deeply.",
    "reassurance": "[EMPATHY] I know this is a shock. It feels like a complete stop, but it is actually a diagnostic answer. Now we know exactly where the block is occurring. We can try specific protocols to overcome this activation failure next time.",
    "call_to_action": "Please come in for a counseling session on {{next_consult_date}}. We need to support you through this loss before planning next steps.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Empty Follicle Syndrome",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}}, hope you are resting after the procedure. 🌸",
    "context": "Main Dr. {{doctor_name}} ki taraf se aaj ke Egg Retrieval ke baare mein update de rahi hoon.",
    "explanation": "Aaj procedure mein humne dekha ki follicles toh the, par unme se eggs retrieve nahi huye. Isse 'Empty Follicle Syndrome' kehte hain. Sometimes trigger injection (HCG) body mein theek se absorb nahi hota, ya eggs follicle wall se detach nahi huye.",
    "next_steps": "Abhi ke liye aap medications stop kar dijiye. Period aane ka wait karein. Next cycle mein hum different trigger protocol use karenge to ensure eggs release hon.",
    "reassurance": "Ye bohot frustrating hai, I know. Par iska matlab ye nahi ki aapke paas eggs nahi hain. Ye aksar 'drug delivery' issue hota hai, egg reserve issue nahi. Next time protocol change se results better milne chahiye.",
    "call_to_action": "Aaj rest karo aur fluids (pani/juice) zyada piyo. Hum kal subah aapko call karenge.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Ectopic Pregnancy Suspected",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}}, this is Dr. {{doctor_name}}. I need to speak with you urgently.",
    "context": "[URGENT/SERIOUS] We've reviewed your latest ultrasound and beta hCG trends.",
    "explanation": "Your hCG levels are rising slowly, but we cannot see a gestational sac in the uterus. There is a strong suspicion of an 'Ectopic Pregnancy', where the embryo has implanted in the fallopian tube instead of the uterus. This is a medical emergency because the tube can rupture.",
    "next_steps": "You need to come to the clinic NOW. We likely need to administer an injection called Methotrexate to stop the pregnancy from growing and protect your tube, or we may need laparoscopic surgery.",
    "reassurance": "The priority right now is your safety. By catching this early, we hope to manage it with medication rather than surgery, preserving your fertility for the future.",
    "call_to_action": "Are you near the clinic? Please come immediately. Do not eat or drink anything in case surgery is needed.",
    "contact_info": "Dr. {{doctor_name}} | Emergency: {{clinic_phone}}"
  },
  {
    "eventName": "Two Week Wait Anxiety Management",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}}! 🧘‍♀️ Hanging in there?",
    "context": "Aapka 'Two Week Wait' period chal raha hai aur hum jante hain ye time sabse mushkil hota hai.",
    "explanation": "Abhi embryo implantation process chal raha hai. Aapko shayad mild cramping ya spotting feel ho—ye normal hai. Google symptoms search karke panic mat hona, kyunki progesterone meds ke symptoms pregnancy jaise hi hote hain.",
    "next_steps": "Apne medicines time pe lete raho. Beta HCG test {{beta_date}} ko scheduled hai. Urine test ghar pe mat karna (false negative aa sakta hai).",
    "reassurance": "Stress lene se outcome change nahi hoga, par aapki tabiyat kharab ho sakti hai. Be kind to yourself. Movie dekho, walk pe jao, distract raho. You have done everything right! ✨",
    "call_to_action": "Agar severe pain ya heavy bleeding ho toh turant call karein. Otherwise, see you on test day!",
    "contact_info": "Nurse {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Post-Negative Beta Grief Support",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, this is Counselor {{nurse_name}} calling from the clinic.",
    "context": "[SOFT/EMPATHETIC] I wanted to check on you a few days after your results. I know this is a very dark time.",
    "explanation": "A failed cycle brings a very specific type of grief—it is a loss of a hope and a future you were imagining. It is completely normal to feel angry, numb, or jealous of others right now. Your hormones are also crashing, which makes the emotions more intense.",
    "next_steps": "There is no rush to decide on the next cycle. Dr. {{doctor_name}} is reviewing your file to see what we can tweak, but right now, your job is just to heal.",
    "reassurance": "Please remember: A negative result is NOT a reflection of your worth as a woman or mother. Even the best embryos sometimes don't stick. Many of our success stories happen on the 2nd or 3rd attempt.",
    "call_to_action": "I'm sending you a link to our support group meeting this Saturday, if you feel like listening to others. No pressure to talk. Take care of yourself.",
    "contact_info": "Counselor {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Family Pressure Coping Strategies",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}}, just checking in gently. 💚",
    "context": "Treatment ke dauran family aur relatives ka pressure kabhi kabhi bohot heavy ho jata hai.",
    "explanation": "India mein aksar log poochte hain 'Khush khabri kab sunaoge?'. Ye sun kar stress hona natural hai. Yaad rakhiye, IVF stress-sensitive process hai. Cortisol (stress hormone) badhne se health pe asar padta hai.",
    "next_steps": "Apne aur {{partner_name}} ke beech ek 'bubble' banao. Decide karo ki kisko kitna batana hai. 'Medical treatment chal raha hai' bol kar topic change karna okay hai.",
    "reassurance": "Ye journey aapki hai. Aapko kisi ko bhi justification dene ki zaroorat nahi hai. Hum aapke saath hain. Strong raho! 💪",
    "call_to_action": "Agar stress manage nahi ho raha, toh let us know. Humare counselor se baat karke bohot relief milta hai.",
    "contact_info": "Counselor {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Financial Stress Counseling",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hi {{patient_name}}, this is the finance manager, [Name]. Do you have a moment?",
    "context": "Dr. {{doctor_name}} mentioned you were worried about the costs for the upcoming cycle steps.",
    "explanation": "IVF is a significant investment, and financial anxiety is very real. We want to make sure money doesn't become the barrier to your treatment. The upcoming PGT-A and FET steps are estimated at roughly ₹{{cost_estimate}}.",
    "next_steps": "We have partnerships with 0% EMI medical loan providers. We can split the payment into 6, 9, or 12 installments. We can also look at a 'freeze-all' approach to spread the cost over a few months.",
    "reassurance": "We are transparent about billing—no hidden costs. We can sit down and prioritize which add-ons are medically necessary vs. optional to optimize your budget.",
    "call_to_action": "Can you come in 30 minutes before your next scan to review the EMI options? I can have the paperwork ready.",
    "contact_info": "Finance Desk | {{clinic_phone}}"
  },
  {
    "eventName": "Medication Ordering and Delivery Instructions",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, Nurse {{nurse_name}} here! 💉📦",
    "context": "Your protocol starts soon. Here are instructions for ordering your stimulation medications.",
    "explanation": "You need: \n1. {{medication_1}} {{dose_1}} \n2. {{medication_2}} {{dose_2}}\n\n*Important:* These injections (like Gonal-F/Menopur) are 'Cold Chain' meds. They MUST be kept in the fridge (not freezer) immediately upon delivery.",
    "next_steps": "Please order today to ensure you have them by Day 2. You can buy from our in-house pharmacy or any authorized fertility chemist.",
    "reassurance": "Don't be intimidated by the needles! We will teach you exactly how to mix and inject on Day 2. Most patients find it much easier than they expected.",
    "call_to_action": "Once delivered, send us a photo of the boxes so we can verify you have the correct dosage. Start date is tentative for {{next_scan_date}}.",
    "contact_info": "Pharmacy: {{clinic_phone}} (Ext 102)"
  },
  {
    "eventName": "Monitoring Appointment Reminder",
    "channel": "sms",
    "language": "hinglish",
    "greeting": "Namaste {{patient_name}}",
    "context": "Reminder: Aapka Follicular Study Scan kal hai.",
    "explanation": "Date: {{next_scan_date}} | Time: {{appt_time}}",
    "next_steps": "Bladder empty karke scan room mein aana. Apne injection file saath layein.",
    "reassurance": "Hum check karenge ki follicles size increase ho raha hai ya nahi.",
    "call_to_action": "Late mat hona please. Confirm reply 'YES' karein.",
    "contact_info": "{{clinic_phone}}"
  },
  {
    "eventName": "When to Stop Treatment Discussion",
    "channel": "verbal",
    "language": "english",
    "greeting": "{{patient_name}}, {{partner_name}}, thank you for coming in today.",
    "context": "[GENTLE/PROFESSIONAL] We are having this meeting to discuss the difficult topic of where we stand medically after {{cycle_count}} cycles.",
    "explanation": "Reviewing the data: your ovarian reserve (AMH) has dropped to {{amh_value}}, and we have not been able to generate euploid embryos in the last three attempts despite high stimulation. Medically, the probability of success with your own eggs has dropped to <5%.",
    "next_steps": "We have two ethical paths: 1. Moving to Donor Eggs, which brings success rates up to 60-70%. 2. Choosing to stop treatment and explore adoption or child-free living.",
    "reassurance": "[EMPATHY] This is not a failure of will or effort. You have fought incredibly hard. Sometimes, the bravest decision is to stop the physical toll on your body. There is no 'right' choice here, only what is right for your mental peace and your marriage.",
    "call_to_action": "I don't want an answer today. Go home, take a month off from clinics/meds. Let's reconnect when you feel ready to decide the direction.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  }
]
