[
  {
    "eventName": "PGT-A Consultation and Decision Making",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}}! Dr. {{doctor_name}} here regarding your IVF plan. 🧬",
    "context": "Hume decide karna hai ki is cycle mein PGT-A (Genetic Testing) karna hai ya nahi.",
    "explanation": "PGT-A mein hum embryo se kuch cells lekar check karte hain ki chromosomes normal (46) hain ya nahi. Iska cost approx ₹15-20k per embryo hota hai. Ye unke liye best hai jinki age 35+ hai ya pehle miscarriages huye hain.",
    "next_steps": "Agar hum ye test karte hain, toh miscarriage ka risk kam ho jata hai aur success rate 10-15% badh jata hai.",
    "reassurance": "Isse hum 'blind' transfer nahi karte, balki sirf best quality embryo choose karte hain. Long term mein ye time aur paisa dono bacha sakta hai.",
    "call_to_action": "Please discuss with {{partner_name}} and let us know your decision by tomorrow so we can prepare the lab.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Consultation and Decision Making",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, this is Dr. {{doctor_name}}. Do you have a moment to discuss the genetic testing option?",
    "context": "Before we finalize your stimulation protocol, we need to decide on Preimplantation Genetic Testing for Aneuploidy (PGT-A).",
    "explanation": "In a standard IVF cycle, we choose embryos based on how they look under a microscope. PGT-A allows us to look at the genetics inside. We biopsy 5-7 cells from the outer layer of the blastocyst on Day 5. We freeze the embryos while waiting for results.",
    "next_steps": "The benefit is a higher implantation rate per transfer (up to 60-70%) and a significantly lower miscarriage rate, as most miscarriages are due to chromosomal errors.",
    "reassurance": "While it is an additional cost upfront, it often prevents the emotional and financial cost of failed transfers or miscarriages later. Given your history, I strongly recommend considering it.",
    "call_to_action": "Do you have any specific worries about the biopsy process I can answer right now?",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Embryo Biopsy Day 5 Procedure",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, update from the embryology lab! 🔬",
    "context": "Your embryos have reached Day 5/6 Blastocyst stage and are ready for biopsy.",
    "explanation": "Our senior embryologist will carefully remove 5-7 cells from the trophectoderm (the part that becomes the placenta). The inner cell mass (baby part) is NOT touched. The embryos will be frozen immediately after.",
    "next_steps": "The sample cells are sent to the genetics lab. Results usually take 14-21 days.",
    "reassurance": "The risk of damage to the embryo during biopsy is very low (<1%) in our lab. They handle the freezing process very well.",
    "call_to_action": "Rest easy! We will notify you as soon as the genetic report arrives.",
    "contact_info": "Lab Director | {{clinic_phone}}"
  },
  {
    "eventName": "Embryo Biopsy Day 5 Procedure",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, calling with a lab update.",
    "context": "Today is Day 5, and we are performing the biopsy on your blastocysts.",
    "explanation": "We have {{follicle_count}} embryos that have expanded beautifully. We are using a laser to gently separate a few cells for the PGT-A test. This is done at the blastocyst stage because the embryo is robust enough to handle it.",
    "next_steps": "Once biopsied, they are vitrified (flash frozen). They stop developing now and will resume exactly where they left off when we thaw them for transfer.",
    "reassurance": "The embryos look high quality, graded {{embryo_grade}}, which makes them excellent candidates for this procedure.",
    "call_to_action": "We will send the final count of biopsied embryos via WhatsApp by this evening.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Results - All Normal Embryos",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}! This is Dr. {{doctor_name}}.",
    "context": "[WARM TONE] I am calling with the best possible news regarding your PGT-A results.",
    "explanation": "The report just came in: ALL {{embryo_count}} embryos tested are Euploid (Normal)! This is a fantastic outcome, better than statistical averages for your age.",
    "next_steps": "We can now schedule your Frozen Embryo Transfer (FET) with high confidence. We will select the single best graded Euploid for transfer.",
    "reassurance": "This confirms that despite the journey to get here, your egg quality is excellent. Implantation chance is now 60-70%.",
    "call_to_action": "Let's plan to start the lining preparation with your next period. Congratulations to you and {{partner_name}}!",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Results - All Normal Embryos",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Namaste {{patient_name}}! Khush khabri hai! 🎉",
    "context": "Aapka genetic testing (PGT-A) report aa gaya hai.",
    "explanation": "Sabhi {{embryo_count}} embryos 'Euploid' (NORMAL) hain! 🌟 Matlab unme 46 chromosomes hain aur wo bilkul healthy hain.",
    "next_steps": "Ab hum confident hokar transfer plan kar sakte hain. Aapke period ke Day 2 par hume call karein.",
    "reassurance": "Is result se pregnancy ke chances maximum ho gaye hain aur miscarriage ka risk almost khatam. Bohot accha result hai!",
    "call_to_action": "Aaj celebrate karein! 🍰 Hum jald hi treatment calendar bhejenge.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Results - All Abnormal Embryos",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, Dr. {{doctor_name}} here.",
    "context": "We have received your PGT-A genetic results from the reference lab.",
    "explanation": "The results are unfortunately not what we hoped for. The embryos tested as 'Aneuploid' (abnormal chromosome count).",
    "next_steps": "I would like to discuss the detailed report with you personally to explain the specific errors found and what this means for our next steps.",
    "reassurance": "Please know this is a reflection of the biology of this specific cycle, not a permanent door closed. We can adjust protocols.",
    "call_to_action": "Are you available for a Zoom call or clinic visit tomorrow at 11 AM?",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Results - All Abnormal Embryos",
    "channel": "verbal",
    "language": "hinglish",
    "greeting": "Hello {{patient_name}}, Dr. {{doctor_name}} bol raha hoon.",
    "context": "[GENTLE TONE] Maine abhi aapka PGT-A report dekha, aur news thodi difficult hai.",
    "explanation": "Report ke hisaab se sabhi embryos mein chromosomal abnormalities aayi hain. [PAUSE] Matlab nature ne unhe select nahi kiya aage badhne ke liye. Agar hum inhe transfer karte, toh miscarriage hota.",
    "next_steps": "Hume samajhna hoga ki ye egg quality ki wajah se hua ya sperm factor se. Main chahta hoon aap clinic aayein taaki hum agla plan bana sakein.",
    "reassurance": "[EMPATHY] Main samajh sakta hoon ye sunna kitna mushkil hai. Par achhi baat ye hai ki humne 'blind transfer' karke aapko emotional trauma se bacha liya. Ab hume pata hai ki hume kya fix karna hai.",
    "call_to_action": "Aap kab aa sakte hain milne? Take your time.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Results - Mixed Normal/Abnormal",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}! PGT-A Results update. 📊",
    "context": "The genetic report is in for your {{total_eggs}} biopsied embryos.",
    "explanation": "Good news: We have {{embryo_count}} NORMAL (Euploid) embryo(s) ready for transfer! 🌟 (Note: Some other embryos were abnormal, which is very common and expected).",
    "next_steps": "We will prioritize the best graded Normal embryo for your transfer. The abnormal ones will be discarded as per protocol.",
    "reassurance": "Having even one Euploid embryo gives us a fantastic chance at a healthy pregnancy. This is a win!",
    "call_to_action": "Let us know when your next period starts to plan the transfer.",
    "contact_info": "Nurse {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Results - Mixed Normal/Abnormal",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, this is Dr. {{doctor_name}} with your results.",
    "context": "I have the PGT-A report. It is a mixed result, which is very typical for IVF.",
    "explanation": "Out of the batch, {{embryo_count}} embryos are Euploid (Normal) and safe to transfer. The others had chromosomal errors. We have identified the 'Golden Embryo' to transfer first.",
    "next_steps": "We will keep the normal embryos in storage. We do not need to do anything with the abnormal ones right now.",
    "reassurance": "This saves us time by ensuring we don't transfer the embryos that wouldn't have worked. We are focusing strictly on the healthy ones.",
    "call_to_action": "We are ready to move to the transfer phase whenever you are.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Mosaic Embryo Discussion",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, Dr. {{doctor_name}} here regarding the report. 🧬",
    "context": "One of your embryos came back as 'Mosaic'.",
    "explanation": "Mosaic means the biopsy showed a mix of normal and abnormal cells. It's not perfectly normal, but not fully abnormal either. These embryos CAN result in healthy babies, though the success rate is slightly lower (30-40%).",
    "next_steps": "We usually keep Mosaic embryos as a backup option after all Euploid embryos are used. Genetic counseling is recommended before transferring.",
    "reassurance": "Recent studies show many Mosaic embryos 'self-correct' in the uterus. It is definitely worth keeping!",
    "call_to_action": "We will mark this as 'Store - Potential Transfer'. No action needed from you now.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Mosaic Embryo Discussion",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, I want to explain a specific finding in your report.",
    "context": "We found a 'Mosaic' embryo. This is a grey area in genetics.",
    "explanation": "A Mosaic result means the sample had say, 60% normal cells and 40% abnormal. In the past, we discarded these, but science has advanced. We now know these can lead to healthy births.",
    "next_steps": "We have three options: 1. Keep as backup. 2. Discard. 3. Donate to research. My recommendation is to keep it as a backup.",
    "reassurance": "Don't worry, we would never transfer this without a detailed discussion and ensuring we have exhausted better options first.",
    "call_to_action": "Think about it and let us know your consent on the storage form.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Sex Selection Ethics and Legality",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, regarding your question about the PGT-A report.",
    "context": "[PROFESSIONAL/FIRM] You asked if the report will show the gender of the embryos.",
    "explanation": "I must clarify that in India, under the PCPNDT Act, sex selection or disclosure of fetal gender is strictly illegal and a punishable offense. The PGT-A report we receive has the sex chromosomes masked (hidden).",
    "next_steps": "We look purely at genetic health (Euploidy), not gender. We will transfer the healthiest embryo regardless of sex.",
    "reassurance": "Our goal is a healthy baby. The genetic testing ensures the baby is free from chromosomal disorders, which is the most important factor.",
    "call_to_action": "I hope you understand our strict adherence to the law. Do you have questions about the *health* aspects of the report?",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Sex Selection Ethics and Legality",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}} 👋",
    "context": "Just a gentle reminder regarding our discussion on PGT-A results.",
    "explanation": "Please note: In compliance with Indian Law (PCPNDT Act), our clinic does NOT disclose the sex of embryos under any circumstance. PGT-A is strictly for medical/genetic health checking.",
    "next_steps": "We will select the embryo with the highest 'Grading' (e.g., 5AA) and 'Euploid' status for transfer.",
    "reassurance": "We are committed to helping you have a healthy, happy baby! 👶",
    "call_to_action": "Thank you for cooperating with our legal policies.",
    "contact_info": "Admin | {{clinic_phone}}"
  },
  {
    "eventName": "Single Euploid Transfer Strategy",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, planning your transfer! 📅",
    "context": "Since we have PGT-A tested Euploid embryos, we recommend a 'Single Embryo Transfer' (SET).",
    "explanation": "A single Euploid embryo has a very high success rate (>60%). Transferring two increases the risk of twins, which are high-risk pregnancies (preterm labor, NICU needs).",
    "next_steps": "We will transfer ONE high-grade embryo. If you have others, they remain safe in the freezer.",
    "reassurance": "Transferring one by one gives you the highest cumulative chance of a healthy baby without the complications of a multiple pregnancy.",
    "call_to_action": "Please confirm you are okay with the Single Transfer strategy.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Single Euploid Transfer Strategy",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, discussing the transfer count.",
    "context": "I want to explain why I am insisting on transferring only one embryo this time.",
    "explanation": "Because we used PGT-A, we know this embryo is genetically potent. If we put two back, there is a 40-50% chance of twins. While twins seem cute, they come with high medical risks for you and the babies.",
    "next_steps": "We transfer one. If it doesn't work (God forbid), we have the second one ready for next month. This gives us two chances at success rather than risking everything on one go.",
    "reassurance": "Trust the quality of the embryo. One good embryo is all it takes.",
    "call_to_action": "Are you comfortable proceeding with a single transfer?",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "No Euploid Embryos - Next Steps",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, this is Dr. {{doctor_name}}.",
    "context": "[EMPATHY/PAUSE] We spoke about the results yesterday, and I know you are hurting.",
    "explanation": "Having zero euploid embryos is a difficult diagnostic finding. It suggests that the issue is likely egg quality related to age or genetics, which IVF alone cannot fix.",
    "next_steps": "We have two paths: 1. Try one more cycle with a different protocol (Growth Hormone, Dual Stim) to see if we can find that one golden egg. 2. Consider Donor Eggs, which would give us an immediate jump to 60-70% success.",
    "reassurance": "Please remember, you can carry a pregnancy perfectly fine—your uterus is great. The issue is just the 'seed'.",
    "call_to_action": "Take a week to think. I am here to guide you whichever path you choose.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "No Euploid Embryos - Next Steps",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, thinking of you. 💚",
    "context": "Following up on our conversation regarding the PGT-A results.",
    "explanation": "I know this is a heavy time. The results showed us the biological hurdle we are facing. It is not your fault.",
    "next_steps": "When you are ready, I want to review the 'Donor Egg' option vs. 'New Protocol' option with you and {{partner_name}}. There are pros and cons to both.",
    "reassurance": "We have handled many cases like this that eventually resulted in a baby. We just need to change the strategy.",
    "call_to_action": "Let me know when you feel ready to schedule a follow-up consult. No rush.",
    "contact_info": "Counselor {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Cost-Benefit Analysis",
    "channel": "sms",
    "language": "english",
    "greeting": "Hi {{patient_name}}",
    "context": "Info regarding PGT-A testing cost.",
    "explanation": "PGT-A adds approx ₹15-20k per embryo. However, it increases success rates and reduces miscarriage risk significantly.",
    "next_steps": "Highly recommended for age 35+. Discuss with Dr if needed.",
    "reassurance": "Investing now can save cost of failed transfers later.",
    "call_to_action": "Reply YES to include PGT-A, NO to opt out.",
    "contact_info": "{{clinic_phone}}"
  },
  {
    "eventName": "PGT-A Cost-Benefit Analysis",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, regarding the finance query.",
    "context": "You asked if PGT-A is worth the extra money.",
    "explanation": "Let's look at the math: Each frozen transfer cost you about ₹50k + meds. If we transfer an abnormal embryo, that money is wasted, plus the emotional cost of a negative result. PGT-A costs ₹20k per embryo but ensures we only transfer the ones that can work.",
    "next_steps": "If we have 4 embryos, testing costs ₹80k. But it might save you 2-3 failed transfer cycles (saving ₹1.5L).",
    "reassurance": "From a financial and emotional efficiency standpoint, PGT-A usually pays for itself by shortening the time to pregnancy.",
    "call_to_action": "Does that breakdown make sense to you?",
    "contact_info": "Finance Team | {{clinic_phone}}"
  },
  {
    "eventName": "Severe OHSS - Hospitalization Required",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, Urgent message from Dr. {{doctor_name}}. 🚨",
    "context": "Based on your symptoms (breathlessness/vomiting), admission is required.",
    "explanation": "You need IV fluids and protein support to manage the OHSS. This is the safest place for you right now.",
    "next_steps": "**Pack a bag:** Toiletries, phone charger, loose clothes. \n**Hospital:** {{hospital_name}} Admission Desk. \n**Duration:** Likely 2-4 days.",
    "reassurance": "We catch this early, it resolves quickly. Your embryos are safe in the lab! Focus on getting better.",
    "call_to_action": "Please leave for the hospital now. Message us when you reach.",
    "contact_info": "Emergency: {{clinic_phone}}"
  },
  {
    "eventName": "Severe OHSS - Hospitalization Required",
    "channel": "sms",
    "language": "hinglish",
    "greeting": "URGENT {{patient_name}}",
    "context": "OHSS symptoms severe hain. Hospital admission zaroori hai.",
    "explanation": "IV fluids aur monitoring chahiye taaki complication na ho.",
    "next_steps": "{{hospital_name}} emergency mein report karein immediately.",
    "reassurance": "Dr ne baat kar li hai wahan. Aap safe rahenge.",
    "call_to_action": "Turant nikle. Delay na karein.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "OHSS Resolution Timeline and Care",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, hoping you feel a bit better! 🌸",
    "context": "Recovery guide for OHSS.",
    "explanation": "Day 1-3 are usually the peak of bloating. By Day 5-7 (post-trigger), you will start peeing more - this is the sign of recovery! The fluid will reabsorb naturally.",
    "next_steps": "Target: 3-4 Liters of fluid/ORS daily. High protein diet (Paneer/Eggs/Chicken/Protein shake).",
    "reassurance": "It feels uncomfortable now, but it is self-limiting. It WILL go away. This indicates you had a very strong response to meds (lots of eggs!).",
    "call_to_action": "Track your weight and urine output daily. Send us a photo of the chart at 6 PM.",
    "contact_info": "Nurse {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "OHSS Resolution Timeline and Care",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, discharge instructions.",
    "context": "You are going home today after OHSS management.",
    "explanation": "You are stable, but not 100% yet. The ovaries are still large. You must NOT do heavy activity or sudden twisting movements (risk of ovarian torsion).",
    "next_steps": "Continue high protein diet at home. If vomiting returns or you cannot pass urine for 6 hours, come back to ER.",
    "reassurance": "Your period will start in a few days, and that will completely resolve the bloating. The worst is over.",
    "call_to_action": "Call us Day 1 of your period. Take care.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Empty Follicle Syndrome",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, Dr. {{doctor_name}} here.",
    "context": "[SERIOUS/GENTLE] I need to discuss the retrieval results.",
    "explanation": "Despite seeing follicles on scan, we could not retrieve eggs. This is 'Empty Follicle Syndrome'. It happens in 1-2% of cases. It usually means the final trigger shot didn't release the eggs from the wall, or there was an absorption issue.",
    "next_steps": "We will not proceed with transfer. For the next cycle, we will change the trigger to 'Dual Trigger' (Lupron + HCG) and check your blood levels the next morning to GUARANTEE absorption.",
    "reassurance": "This does NOT mean you have no eggs left. It is a technical/medication failure, not a biological failure. We can fix the protocol.",
    "call_to_action": "Rest today. Let's meet next week to plan the corrective protocol.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Empty Follicle Syndrome",
    "channel": "sms",
    "language": "english",
    "greeting": "Hi {{patient_name}}",
    "context": "Retrieval procedure update.",
    "explanation": "Dr. {{doctor_name}} needs to discuss the findings with you personally.",
    "next_steps": "Please do not worry, but we need to explain the outcome.",
    "reassurance": "We have a plan for this situation.",
    "call_to_action": "Please call the doctor's direct line when you wake up.",
    "contact_info": "{{clinic_phone}}"
  },
  {
    "eventName": "Total Fertilization Failure - Zero Embryos",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, Nurse {{nurse_name}} here.",
    "context": "Following up on your call with the doctor regarding the fertilization results.",
    "explanation": "I know the news about 'Zero Fertilization' was shocking. As Dr. explained, it's likely an egg activation issue.",
    "next_steps": "We have scheduled a counseling session for you on {{next_consult_date}} to discuss 'Calcium Ionophore' usage for the next round.",
    "reassurance": "This is a diagnostic hurdle. We now know exactly what went wrong and have tools to fix it. Don't lose hope! 💚",
    "call_to_action": "Please confirm the appointment time.",
    "contact_info": "Clinic Admin | {{clinic_phone}}"
  },
  {
    "eventName": "Total Fertilization Failure - Zero Embryos",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}} 🌻",
    "context": "Kal ke results ke baad main bas check-in kar rahi thi.",
    "explanation": "Zero embryos banna bohot rare hai, par iska solution hai. Next time hum 'ICSI + Activation' use karenge.",
    "next_steps": "Abhi body ko rest do. Period aane ka wait karo.",
    "reassurance": "Ek failure ka matlab ye nahi ki aap parents nahi ban sakte. Hum protocol change karke dubara try karenge.",
    "call_to_action": "Hum aapke saath hain. Call anytime if you feel low.",
    "contact_info": "Nurse {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Embryo Arrest at Day 3",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, lab update regarding your embryos. 🔬",
    "context": "We have been monitoring the development from Day 3 to Day 5.",
    "explanation": "Unfortunately, the embryos have 'arrested' (stopped growing) at the cellular stage and did not form Blastocysts. We cannot perform the transfer.",
    "next_steps": "This often indicates a sperm DNA issue or egg quality factor. We need to stop meds and wait for your period.",
    "reassurance": "It is better that they stopped now than causing a miscarriage later. Nature has a quality control mechanism.",
    "call_to_action": "Dr. {{doctor_name}} wants to review the sperm DNA fragmentation test. Please book a consult.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Embryo Arrest at Day 3",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, Dr. {{doctor_name}} calling.",
    "context": "[GENTLE/PAUSE] I have the final culture report, and I'm afraid we won't be doing a transfer tomorrow.",
    "explanation": "Your embryos grew to Day 3 but failed to make the jump to Day 5 Blastocysts. This is called 'Embryo Arrest'. It suggests the genetic engine of the embryo ran out of energy.",
    "next_steps": "We need to investigate both partners. We may recommend supplements for 3 months before trying again.",
    "reassurance": "This is painful, but informative. It tells us we need to work on gamete quality before generating embryos again.",
    "call_to_action": "I know you are disappointed. Take today to grieve. Let's talk strategy on Monday.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "No Blastocysts Formed",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, Dr. {{doctor_name}} here.",
    "context": "[EMPATHY] I am calling with difficult news from the embryology lab.",
    "explanation": "None of the embryos developed into Blastocysts suitable for transfer or freezing. They all degenerated after Day 3.",
    "next_steps": "This cycle is cancelled. We will not charge you for the transfer or freezing steps.",
    "reassurance": "This is a severe outcome, but not the end of the road. It might be time to discuss if 'Donor Eggs' or 'Donor Sperm' would give us the success we want, depending on whose cells we suspect.",
    "call_to_action": "I want to see you in clinic to show you the growth charts and explain better.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "No Blastocysts Formed",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}",
    "context": "Following our call about the lab results.",
    "explanation": "We know how devastating it is to have no embryos to transfer. We are all saddened by this outcome.",
    "next_steps": "We have arranged a 'Failed Cycle Review' meeting with the Lab Director and Doctor for {{next_consult_date}}.",
    "reassurance": "Please don't give up. We just need to find the right key for the lock.",
    "call_to_action": "Please confirm if you can attend the review meeting.",
    "contact_info": "Clinic Coordinator | {{clinic_phone}}"
  },
  {
    "eventName": "Vanishing Twin Syndrome",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, regarding today's scan. 👶",
    "context": "Ultrasound showed 1 strong heartbeat, but the second sac has stopped growing.",
    "explanation": "This is 'Vanishing Twin Syndrome'. One embryo is continuing perfectly (Heartbeat: {{heartbeat_bpm}} bpm), while the other has been reabsorbed. This is very common in IVF (20-30% of twin starts).",
    "next_steps": "Focus on the healthy baby! The vanishing twin does NOT harm the survivor.",
    "reassurance": "You are still pregnant with a healthy baby! This is actually safer for you than a twin pregnancy.",
    "call_to_action": "Continue all meds as prescribed. Next scan in 2 weeks.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Vanishing Twin Syndrome",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, Dr. {{doctor_name}} here.",
    "context": "I wanted to explain what we saw on the scan today.",
    "explanation": "We saw two sacs initially, but today only one has a heartbeat. The other sac is empty. This is nature's way of reducing a high-risk twin pregnancy to a safer singleton pregnancy.",
    "next_steps": "You may have some light spotting as the tissue resolves - do not panic.",
    "reassurance": "The remaining baby is growing perfectly on track. You have a healthy pregnancy.",
    "call_to_action": "Any questions? I don't want you worrying about the loss, focus on the life.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Vanishing Twin Syndrome",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}} 🤰",
    "context": "Scan update: Ek baby bilkul healthy hai! ❤️",
    "explanation": "Dusra sac grow nahi kar raha (Vanishing Twin). Ye IVF mein aksar hota hai. God has decided that one healthy baby is best for you right now.",
    "next_steps": "Healthy baby ki heartbeat {{heartbeat_bpm}} hai - very strong! 💪",
    "reassurance": "Daro mat, jo baby bacha hai wo bilkul safe hai. Twins pregnancy risky hoti hai, single pregnancy safest hai.",
    "call_to_action": "Happy raho! You are going to be a mother.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Ectopic Pregnancy Suspected",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}",
    "context": "Post-treatment instructions for Methotrexate injection.",
    "explanation": "You have received the injection to treat the ectopic pregnancy. This stops the cells from dividing.",
    "next_steps": "1. Do NOT take prenatal vitamins/folic acid (it stops the med from working).\n2. Avoid sun exposure.\n3. Expect some abdominal pain.",
    "reassurance": "This treatment usually works well and saves your tubes for future pregnancy.",
    "call_to_action": "Come for repeat Beta hCG on Day 4 and Day 7. This is critical to ensure levels drop.",
    "contact_info": "Nurse {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Ectopic Pregnancy Suspected",
    "channel": "sms",
    "language": "english",
    "greeting": "URGENT {{patient_name}}",
    "context": "Potential Ectopic Pregnancy Warning.",
    "explanation": "Pain/bleeding reported is concerning. Risk of tube rupture.",
    "next_steps": "Come to clinic IMMEDIATELY. If clinic closed, go to nearest Hospital ER.",
    "reassurance": "Better to be safe.",
    "call_to_action": "Do not eat/drink. Report now.",
    "contact_info": "Emergency: {{clinic_phone}}"
  },
  {
    "eventName": "Biochemical Pregnancy Explanation",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, Dr. {{doctor_name}} here.",
    "context": "Explaining the drop in your beta hCG levels (Biochemical Pregnancy).",
    "explanation": "The embryo started to implant (hence positive test) but stopped developing very early. It's a very early miscarriage.",
    "next_steps": "Stop medications. Your period will start in 3-5 days. It may be heavier than usual.",
    "reassurance": "The Silver Lining: Implantation HAPPENED! This proves your uterus can accept an embryo. Patients with biochemicals often have high success in the very next cycle.",
    "call_to_action": "Let's track your hCG to zero next week, then plan the next transfer.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Biochemical Pregnancy Explanation",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}.",
    "context": "[GENTLE] I'm calling about your second beta result.",
    "explanation": "The level has dropped from {{beta_value_1}} to {{beta_value_2}}. This confirms a 'Chemical Pregnancy'. The pregnancy was there, but it didn't stay.",
    "next_steps": "It's physically just like a period. You don't need surgery or D&C.",
    "reassurance": "I know this is teasing—to have a positive then lose it. But medically, it's a good prognostic sign for the future compared to no implantation at all. Your body tried.",
    "call_to_action": "Take care of yourself. Call us when the bleeding starts.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Blighted Ovum Diagnosis",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, Dr. {{doctor_name}} here.",
    "context": "[GENTLE] I need to discuss the ultrasound findings.",
    "explanation": "We can see the gestational sac has grown, but unfortunately, it is empty. No embryo/yolk sac developed inside. This is called an 'Anembryonic Pregnancy' or Blighted Ovum.",
    "next_steps": "We have 3 options: 1. Wait for natural miscarriage. 2. Take medication (Misoprostol) to start it. 3. D&C procedure (cleaning).",
    "reassurance": "This is almost always a random genetic error in that specific embryo. It does not mean it will happen again.",
    "call_to_action": "I recommend the D&C so we can test the tissue and confirm the genetic cause. What do you think?",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Blighted Ovum Diagnosis",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}} 🤍",
    "context": "Follow up after our scan discussion.",
    "explanation": "I know the diagnosis of Blighted Ovum is confusing - looking pregnant but no baby. It is a cruel trick of nature.",
    "next_steps": "You have chosen the D&C option. Please come fasting (no food/water) tomorrow at 8 AM.",
    "reassurance": "The procedure is painless (under anesthesia) and over in 15 mins. You will recover physically in 1 day.",
    "call_to_action": "Please acknowledge receipt of instructions.",
    "contact_info": "Nurse {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Miscarriage Management Options",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}.",
    "context": "[EMPATHY] Since the pregnancy is not viable, we need to manage the miscarriage safely.",
    "explanation": "Option 1: Expectant (Wait for it to happen naturally). \nOption 2: Medical (Tablets to induce bleeding at home - can be painful). \nOption 3: Surgical (D&C - quick, asleep, done in clinic).",
    "next_steps": "For IVF patients, I often suggest D&C so we can do genetic testing on the tissue (POC testing) to learn WHY this happened.",
    "reassurance": "There is no wrong choice. Choose what feels best for your mental health.",
    "call_to_action": "Discuss with your partner and text me your decision by evening.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Miscarriage Management Options",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}",
    "context": "Decision Aid for Miscarriage Management.",
    "explanation": "**1. Natural:** Unpredictable timing, heavy bleeding. \n**2. Meds:** Controlled timing, strong cramps/bleeding at home. \n**3. Surgery (D&C):** Scheduled, painless, over quickly.",
    "next_steps": "Let us know your preference.",
    "reassurance": "All options are safe. We are here to support you through the physical process.",
    "call_to_action": "If you choose Meds/Natural, buy extra thick pads and painkillers.",
    "contact_info": "Nurse {{nurse_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Miscarriage Management Options",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}} 💔",
    "context": "Miscarriage management ke baare mein.",
    "explanation": "Agar aap D&C (cleaning) choose karte ho, toh ye sabse painless option hai. Aap behosh honge (anesthesia) aur 10 min mein procedure khatam. Ghar pe dard bardasht nahi karna padega.",
    "next_steps": "Agar aap ready hain, toh hum kal ka slot book kar sakte hain.",
    "reassurance": "Hum aapke saath hain. Daro mat. Physical recovery jaldi ho jayegi.",
    "call_to_action": "Reply YES for D&C booking.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Recurrent Implantation Failure Investigation",
    "channel": "whatsapp",
    "language": "english",
    "greeting": "Hi {{patient_name}}, planning next steps. 📋",
    "context": "Since we have had 3 failed transfers, we need to dig deeper.",
    "explanation": "We are classifying this as 'Recurrent Implantation Failure' (RIF). Standard IVF isn't working, so we investigate.",
    "next_steps": "**Tests needed:** \n1. ERA (Endometrial Receptivity Analysis) \n2. Hysteroscopy (Camera inside uterus) \n3. TB PCR (Rule out latent TB) \n4. Karyotyping (Genetics for parents)",
    "reassurance": "Often, it's just a timing issue (ERA) or a small polyp. Finding the cause is the key to success!",
    "call_to_action": "These tests cost approx ₹50k total. Shall we proceed next cycle?",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Recurrent Implantation Failure Investigation",
    "channel": "verbal",
    "language": "english",
    "greeting": "Hello {{patient_name}}, Dr. {{doctor_name}} here.",
    "context": "I want to propose a 'Investigative Cycle' before we transfer any more embryos.",
    "explanation": "We have good embryos, but they aren't sticking. We need to check the 'soil' (uterus). I recommend a Hysteroscopy and an ERA test.",
    "next_steps": "We will skip a month of transfer and just do these tests. The ERA involves taking a biopsy of the lining at the exact time we would usually transfer.",
    "reassurance": "I have had many patients who failed 3 times, did the ERA, adjusted the timing by 12 hours, and got pregnant immediately. It's worth checking.",
    "call_to_action": "Come in on Day 2 so I can explain the timeline.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  },
  {
    "eventName": "Recurrent Implantation Failure Investigation",
    "channel": "whatsapp",
    "language": "hinglish",
    "greeting": "Hi {{patient_name}}",
    "context": "3 attempts fail huye hain. Ab hum 'Blind' nahi chal sakte.",
    "explanation": "Hume investigate karna padega ki rejection kyu ho raha hai. India mein 'Genital TB' (Tuberculosis) ek common reason hai silent failure ka.",
    "next_steps": "Hum uterine tissue lekar TB PCR aur CD-138 (infection) ka test karenge.",
    "reassurance": "Agar infection mila, toh antibiotics se cure ho jayega aur pregnancy ruk jayegi. Hope mat chhodo.",
    "call_to_action": "Let's meet to discuss the testing plan.",
    "contact_info": "Dr. {{doctor_name}} | {{clinic_phone}}"
  }
]
